Tekla Open API Reference for Tekla Structures 2025
Operation.CreateDGNv8Export Method
 Dgn export from all or selected objects.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool CreateDGNv8Export(
	string FileName,
	string Folder,
	Operation.ExportBasePoint BasePoint,
	string BasePointGuid,
	string ObjectColoring,
	string ExportLayersAs,
	bool OnlyFromSelectedObjects
)
Public Shared Function CreateDGNv8Export (
	FileName As String,
	Folder As String,
	BasePoint As Operation.ExportBasePoint,
	BasePointGuid As String,
	ObjectColoring As String,
	ExportLayersAs As String,
	OnlyFromSelectedObjects As Boolean
) As Boolean
Parameters
FileName
Type: System.String
 The file name.
Folder
Type: System.String
 The folder.
BasePoint
Type: Tekla.Structures.Model.Operations.Operation.ExportBasePoint
Defines which base point is used in export.
BasePointGuid
Type: System.String
Base point guid if BasePoint parameter is set to BASE_POINT.
ObjectColoring
Type: System.String
Defines which object coloring filter is to be used in export.
ExportLayersAs
Type: System.String
Defines which report field to use for layers export.
OnlyFromSelectedObjects
Type: System.Boolean
Defines if only selected (value true) or all (value false) objects are exported.
Return Value
Type: Boolean
True, if Dgn export was successful, otherwise false.
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace